[AdvDroidTrooper_M1 X2CharacterTemplate]
strCharacterName="ADVENT Droid"
[AdvDroidTrooper_M2 X2CharacterTemplate]
strCharacterName="ADVENT Droid Veteran"
[AdvDroidTrooper_M3 X2CharacterTemplate]
strCharacterName="ADVENT Droid Elite"